## 데이터 프레임 기본연산

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3),columns=['a','b','c'])
df

          a         b         c
0  0.686565  0.180453  0.626845
1  0.226785 -0.768335  0.387056
2  0.171124 -0.075630  1.193896
3  0.028834  0.395203  0.215905
4 -1.029013  1.317438  0.397146

## 열하나에 대하여 자주사용되는 연산

In [3]:
df['a']+2

0    2.686565
1    2.226785
2    2.171124
3    2.028834
4    0.970987
Name: a, dtype: float64

In [4]:
df['a']*2

0    1.373130
1    0.453569
2    0.342248
3    0.057668
4   -2.058027
Name: a, dtype: float64

In [5]:
df['a']

0    0.686565
1    0.226785
2    0.171124
3    0.028834
4   -1.029013
Name: a, dtype: float64

In [6]:
max(df['a'])

0.6865650509831678

In [7]:
df['a'].max()

0.6865650509831678

In [8]:
df['a'].min()

-1.0290133978420335

In [9]:
np.mean(df['a'])

0.01685882901039042

In [10]:
df['a'].mean()

0.01685882901039042

In [11]:
df['a'].std()

0.6345008032384499

In [12]:
## 열단위 연산
df['a']=df['a']*2
df

          a         b         c
0  1.373130  0.180453  0.626845
1  0.453569 -0.768335  0.387056
2  0.342248 -0.075630  1.193896
3  0.057668  0.395203  0.215905
4 -2.058027  1.317438  0.397146

In [13]:
df['d']=df['a']+df['b']
df

          a         b         c         d
0  1.373130  0.180453  0.626845  1.553583
1  0.453569 -0.768335  0.387056 -0.314766
2  0.342248 -0.075630  1.193896  0.266618
3  0.057668  0.395203  0.215905  0.452871
4 -2.058027  1.317438  0.397146 -0.740589

In [14]:
df['e']=df['a']/df['c']
df

          a         b         c         d         e
0  1.373130  0.180453  0.626845  1.553583  2.190541
1  0.453569 -0.768335  0.387056 -0.314766  1.171843
2  0.342248 -0.075630  1.193896  0.266618  0.286664
3  0.057668  0.395203  0.215905  0.452871  0.267099
4 -2.058027  1.317438  0.397146 -0.740589 -5.182038

## 행이나 열에 함수 적용하기

### apply: 여러개의 값 input -> 하나의 값 output (행, 열단위)

In [15]:
df['a']

0    1.373130
1    0.453569
2    0.342248
3    0.057668
4   -2.058027
Name: a, dtype: float64

In [16]:
np.mean(df['a'])

0.03371765802078084

In [17]:
# 모든 열의 평균을 구하고 싶다면 어떻게 해야할까?
# apply: 모든 열이나 행단위로 지정된 연산을 수행하는 함수

In [18]:
df.apply(np.mean) #행단위적용

a    0.033718
b    0.209826
c    0.564170
d    0.243543
e   -0.253178
dtype: float64

In [19]:
df.apply(np.mean,axis=1) #열단위적용

0    1.184910
1    0.185874
2    0.402759
3    0.277749
4   -1.253214
dtype: float64

In [20]:
np.max(df['a'])

1.3731301019663356

In [21]:
df.apply(np.max)

a    1.373130
b    1.317438
c    1.193896
d    1.553583
e    2.190541
dtype: float64

In [22]:
df.apply(np.max,axis=1)

0    2.190541
1    1.171843
2    1.193896
3    0.452871
4    1.317438
dtype: float64

### apply 사용자 함수와 함께 사용하기

In [23]:
def diff(x):
    return x.max()-x.min()

In [24]:
df.apply(diff)

a    3.431157
b    2.085773
c    0.977991
d    2.294172
e    7.372579
dtype: float64

In [25]:
#각 열별로 0보다 큰 수의 갯수를 구하여라
#각 행별로 0보다 작은 수의 갯수를 하여라

### agg (aggregation) 함수

In [26]:
df.agg([np.mean,np.sum,np.std]) #axis는 통하지 않음

             a         b         c         d         e
mean  0.033718  0.209826  0.564170  0.243543 -0.253178
sum   0.168588  1.049129  2.820850  1.217717 -1.265891
std   1.269002  0.758339  0.381129  0.871891  2.866105

### describe 함수

In [27]:
df.describe()

              a         b         c         d         e
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.033718  0.209826  0.564170  0.243543 -0.253178
std    1.269002  0.758339  0.381129  0.871891  2.866105
min   -2.058027 -0.768335  0.215905 -0.740589 -5.182038
25%    0.057668 -0.075630  0.387056 -0.314766  0.267099
50%    0.342248  0.180453  0.397146  0.266618  0.286664
75%    0.453569  0.395203  0.626845  0.452871  1.171843
max    1.373130  1.317438  1.193896  1.553583  2.190541

### transform: 여러개의 값 -> 여러개의 값으로 변환 (행, 열단위)

In [28]:
np.abs([-1,-2])

array([1, 2])

In [29]:
df.transform(np.abs)

          a         b         c         d         e
0  1.373130  0.180453  0.626845  1.553583  2.190541
1  0.453569  0.768335  0.387056  0.314766  1.171843
2  0.342248  0.075630  1.193896  0.266618  0.286664
3  0.057668  0.395203  0.215905  0.452871  0.267099
4  2.058027  1.317438  0.397146  0.740589  5.182038

In [30]:
def pos_neg(x):
    result=[]
    for i in x:
        if i > 0:
            result.append(1)
        else:
            result.append(-1)
    return result

pos_neg([-3.2,-2,1,1,-5])

[-1, -1, 1, 1, -1]

In [31]:
df.transform(pos_neg)

   a  b  c  d  e
0  1  1  1  1  1
1  1 -1  1 -1  1
2  1 -1  1  1  1
3  1  1  1  1  1
4 -1  1  1 -1 -1

In [32]:
df

          a         b         c         d         e
0  1.373130  0.180453  0.626845  1.553583  2.190541
1  0.453569 -0.768335  0.387056 -0.314766  1.171843
2  0.342248 -0.075630  1.193896  0.266618  0.286664
3  0.057668  0.395203  0.215905  0.452871  0.267099
4 -2.058027  1.317438  0.397146 -0.740589 -5.182038

### 유용한 기능: 이산변수에서 값들의 빈도수

In [33]:
## 이산변수에서 값의 빈도수 세기
df2=pd.DataFrame({'a':['a','a','b','c','a'],'b':['f','f','f','m','m']})
df2

   a  b
0  a  f
1  a  f
2  b  f
3  c  m
4  a  m

In [34]:
df2['a'].value_counts()

a    3
b    1
c    1
Name: a, dtype: int64

### 유용한 기능: 유일한값 (unique value) 구하기

In [36]:
df2['a'].unique()

array(['a', 'b', 'c'], dtype=object)

In [37]:
df2['b'].unique()

array(['f', 'm'], dtype=object)

### 유용한 기능: 외부파일 불러오기

In [40]:
import pandas as pd
df3=pd.read_csv('salary.csv')

### 유용한 기능: 처음 레코드 x개 불러오기

In [41]:
df3.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011.0,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011.0,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011.0,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011.0,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011.0,NaN,San Francisco,NaN

### 유용한 기능: 마지막 레코드 x개 불러오기

In [42]:
df3.tail(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
25339,25340,SAI HO LEE,CLERK TYPIST,47971.83,0.0,0.00,NaN,47971.83,47971.83,2011.0,NaN,San Francisco,NaN
25340,25341,CHARLES YEH,CLERK,46386.55,0.0,1584.05,NaN,47970.60,47970.60,2011.0,NaN,San Francisco,NaN
25341,25342,JOSETTE LEIVA,CLERK,46386.46,0.0,1584.00,NaN,47970.46,47970.46,2011.0,NaN,San Francisco,NaN
25342,25343,SALLY LAMUS,ELIGIBILITY WORKER,46710.08,0.0,1260.00,NaN,47970.08,47970.08,2011.0,NaN,San Francisco,NaN
25343,25344,DANIEL PONCE,SENIOR LEGAL PROCESS CLERK,46964.73,0.0,1000.00,NaN,47.00,NaN,NaN,NaN,NaN,NaN

### 유용한 기능: 열의 이름만 출력

In [43]:
df3.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')